app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" ASC
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? AND "votes"."vote" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["vote", 1], ["LIMIT", 1]]
---
      <li>
      <%= button_to 'Upvote', indexupvote_post_path(post), method: :post, id: ("voted" if current_user.present? && current_user.votes.exists?(post_id: post.id, vote: 1)) %>

SELECT SUM("votes"."vote") FROM "votes" WHERE "votes"."post_id" = ?  [["post_id", 6]]
---
        <div id="counter_<%= post.id %>" class="votecount">
        <% if post.votes.sum(:vote) > 0 %>
           <%= '^' %>
           <% elsif post.votes.sum(:vote) < 0 %>

SELECT SUM("votes"."vote") FROM "votes" WHERE "votes"."post_id" = ?  [["post_id", 6]]
---
          <% end %>
          <%= post.votes.sum(:vote).abs %>

SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? AND "votes"."vote" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["vote", -1], ["LIMIT", 1]]
---
      <li>
        <%= button_to 'Downvote', indexdownvote_post_path(post), method: :post, id: ("voted" if current_user&.votes&.exists?(post_id: post.id, vote: -1)) %>