app/views/posts/show.html.erb

  <li>
    <%= button_to 'Upvote' , upvote_post_path(@post), method: :post, id: ("voted" if current_user&.votes&.exists?(post_id: @post.id, vote: 1)) %>
---
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? AND "votes"."vote" = ? LIMIT ?  [["user_id", 1], ["post_id", 7], ["vote", 1], ["LIMIT", 1]]

  <li>
  <% if @post.votes.sum(:vote) > 0 %>
           <%= '^' %>
           <% elsif @post.votes.sum(:vote) < 0 %>
---
SELECT SUM("votes"."vote") FROM "votes" WHERE "votes"."post_id" = ?  [["post_id", 7]]

          <% end %>
          <%= @post.votes.sum(:vote).abs %>
---
SELECT SUM("votes"."vote") FROM "votes" WHERE "votes"."post_id" = ?  [["post_id", 7]]

  <li>
    <%= button_to 'Downvote' , downvote_post_path(@post), method: :post, id: ("voted" if current_user&.votes&.exists?(post_id: @post.id, vote: -1)) %>
---
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? AND "votes"."vote" = ? LIMIT ?  [["user_id", 1], ["post_id", 7], ["vote", -1], ["LIMIT", 1]]