app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["post_id", 1], ["user_id", 1], ["created_at", "2023-05-27 08:43:31.155876"], ["updated_at", "2023-05-27 08:43:31.155876"]]
---
    def create
      @comment = @post.comments.build(comment_params)
      if @comment.save