app/controllers/posts_controller.rb

  def upvote
    @post = Post.find(params[:id])
    unless current_user.upvotes.exists?(post_id: @post.id)
      current_user.upvotes.create(post_id: @post.id)
---
INSERT INTO "votes" ("post_id", "user_id", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 7], ["user_id", 1], ["vote", 1], ["created_at", "2023-05-28 18:14:15.244115"], ["updated_at", "2023-05-28 18:14:15.244115"]]

  def downvote
    @post = Post.find(params[:id])
    unless current_user.downvotes.exists?(post_id: @post.id)
      current_user.downvotes.create(post_id: @post.id)
---
INSERT INTO "votes" ("post_id", "user_id", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 7], ["user_id", 1], ["vote", -1], ["created_at", "2023-05-28 18:18:31.794374"], ["updated_at", "2023-05-28 18:18:31.794374"]]