app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC
---
  def index
    #to order all posts in the order of creation from newest created to oldest
    @posts = Post.order(created_at: :asc)

SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" ASC
---
  def index_updated
    @posts = Post.order(updated_at: :asc)

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["user_id", 1], ["created_at", "2023-05-28 18:11:22.332789"], ["updated_at", "2023-05-28 18:11:22.332789"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test_updated"], ["updated_at", "2023-05-28 19:02:07.374103"], ["id", 6]]
---
  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
UPDATE "votes" SET "vote" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["vote", 1], ["updated_at", "2023-05-28 18:47:35.876675"], ["id", 11]]
---
  def upvote
    @post = Post.find(params[:id])
    vote = current_user.votes.find_or_initialize_by(post: @post)
    if vote.vote == 1
      vote.destroy
    else
      vote.update(vote: 1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 7], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 2]]
UPDATE "votes" SET "vote" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["vote", -1], ["updated_at", "2023-05-28 18:14:15.951487"], ["id", 2]]
---
  def downvote
    @post = Post.find(params[:id])
    vote = current_user.votes.find_or_initialize_by(post: @post)
    if vote.vote == -1
      vote.destroy
    else
      vote.update(vote: -1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["LIMIT", 1]]
---
  def indexupvote
    @post = Post.find(params[:id])
    vote = current_user.votes.find_or_initialize_by(post: @post)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 7], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 3]]
UPDATE "votes" SET "vote" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["vote", -1], ["updated_at", "2023-05-28 18:18:27.806194"], ["id", 3]]
---
  def indexdownvote
    @post = Post.find(params[:id])
    vote = current_user.votes.find_or_initialize_by(post: @post)
    if vote.vote == -1
      vote.destroy
    else
      vote.update(vote: -1)